CREATE TABLE test_table (
    name VARCHAR(10) NOT NULL,
    surname VARCHAR(50) NOT NULL,
    city VARCHAR(50) NOT NULL,
    age INT CHECK (age > 0 AND age <= 150) NOT NULL
);

INSERT INTO test_table (name, surname, city, age) VALUES
('Иван', 'Иванов', 'Москва', 25),
('Ольга', 'Петрова', 'Санкт-Петербург', 34),
('Анна', 'Сидорова', 'Новосибирск', 29),
('Дмитрий', 'Кузнецов', 'Екатеринбург', 42),
('Елена', 'Попова', 'Казань', 37),
('Сергей', 'Смирнов', 'Челябинск', 19),
('Мария', 'Волкова', 'Омск', 31),
('Алексей', 'Лебедев', 'Ростов-на-Дону', 45),
('Наталья', 'Морозова', 'Уфа', 28),
('Владимир', 'Новиков', 'Воронеж', 54),
('Юлия', 'Крылова', 'Пермь', 22),
('Павел', 'Зайцев', 'Красноярск', 38),
('Светлана', 'Богданова', 'Самара', 30),
('Николай', 'Соловьев', 'Томск', 41),
('Виктор', 'Васильев', 'Ижевск', 27),
('Татьяна', 'Михайлова', 'Тула', 35),
('Андрей', 'Фёдоров', 'Ярославль', 40),
('Екатерина', 'Белоусова', 'Барнаул', 26),
('Галина', 'Громова', 'Тверь', 33),
('Леонид', 'Ершов', 'Белгород', 47);

